slides/HW10-Microdata.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HW10-Microdata</title>
<!-- 2014-11-06 Thu 23:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jim Blomo" />
<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">HW10-Microdata</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Homework</a></li>
<li><a href="#sec-2">2. Meta Information</a></li>
<li><a href="#sec-3">3. Person</a></li>
<li><a href="#sec-4">4. Organization</a></li>
<li><a href="#sec-5">5. Other</a></li>
<li><a href="#sec-6">6. Microdata</a></li>
<li><a href="#sec-7">7. Summary</a></li>
<li><a href="#sec-8">8. Git</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Homework&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Improve the SEO of your portfolio page
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Meta Information&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Make sure to set a descriptive <code>title</code> tag
</li>
<li>Fill out the <code>description</code> <code>meta</code> tag
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Person&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Mark up your own information:
<ul class="org-ul">
<li>name
</li>
<li>jobTitle
</li>
<li>affiliation
</li>
<li>3 more from <a href="http://schema.org/Person">Schema.org Person</a>
</li>
</ul>
</li>
<li>Check on <a href="http://www.google.com/webmasters/tools/richsnippets">Structed
Data Testing Tool</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Organization&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>name
</li>
<li>url
</li>
<li>3 more from <a href="http://schema.org/Organization">Schema.org Organization</a>
</li>
<li>Check on <a href="http://www.google.com/webmasters/tools/richsnippets">Structed
Data Testing Tool</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Other&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Choose any other schema
</li>
<li>Examples: Event, Place, Product
</li>
<li><a href="http://schema.org/docs/schemas.html">Schema.org</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Microdata&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">
<dl class="org-dl">
<dt> <code>itemscope</code> </dt><dd>attribute of parent node encompasing <code>itemprop</code>
</dd>
<dt> <code>itemtype</code> </dt><dd>URL of schema, eg <code>http://schema.org/People</code>
</dd>
<dt> <code>itemprop</code> </dt><dd>property of item being described. Encompasing text is the
value
</dd>
<dt> <a href="http://people.ischool.berkeley.edu/~jblomo/">Demo</a> </dt><dd>note: not complete
</dd>
</dl>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Summary&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Metadata
</li>
<li>Person Microdata
</li>
<li>Organization Microdata
</li>
<li>Other Microdata
</li>
<li>Submit via git
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>`git checkout -b hw10-microdata master &amp;&amp; git merge hw2-html`
</li>
<li>OR
</li>
<li>`git checkout -b hw10-microdata hw2-html`
</li>
</ul>

<script type="text/javascript" src="production/org-html-slideshow.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jim Blomo</p>
<p class="date">Created: 2014-11-06 Thu 23:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
